using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
//«Фигура», «Точка», «Правильный многоугольник», «Многоугольник», «Многоугольник закрашенный», «Пирамида», «Призма»

    //2.	Определите в этих классах методы, которые: 
//• перемещают фигуру по плоскости(на заданное расстояние или в нужную позицию);
//• масштабируют фигуру;
//• вычисляют и возвращают площадь фигуры, периметр;
//• возвращают строку символов, отражающую имя класса и состояние объекта(его основные характеристики);
//• рисуют фигуру в консоли или на форме(для объемных фигур достаточно проекции, например, изометрической или диметрической);
//• и т.п.
//_________
//* на «тройку» достаточно реализовать три метода 

//3.	Определите в ваших классах свойства и индексаторы (хотя бы в некоторых  классах ).

//4.	Классы должны быть связаны отношением наследования(там, где это имеет смысл)
//Некоторые классы необходимо сделать абстрактными, а некоторые методы — виртуальными
//Должен быть хотя бы один полиморфный класс.
//Максимально исключите дублирование кода (поля, методы, реализация).

namespace Laba3
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
