using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
//Класс "Отрезок"
//Объявите класс «Отрезок», с полями x1, y1, x2, y2(координаты двух точек отрезка), +
//методами для перемещения отрезка,+ вывода на экран, проверки попадания обоих точек в одинаковый квадрант, 
//и свойством для получения длины отрезка.+

//скрытые поля, конструкторы с параметрами и без параметров, методы, свойства.Методы и свойства должны обеспечивать непротиворечивый,
//полный, минимальный и удобный интерфейс класса.Проверяйте допустимость значений параметров перед выполнением кода методов.

namespace Laba2._1
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
